In [1]:
import pandas as pd

import numpy as np

import seaborn as sns

import matplotlib.pyplot as plt

In [2]:
data = {
    'Column1':[],
    'Column2':[],
    'Column3':[],
    'Column4':[],
    'Column5':[]
    
}

df = pd.DataFrame(data)

In [14]:
data1 = {
    'One':[],
    'Two':[],
    'Three':[],
    'Four':[],
    'Five':[]
}

df1 = pd.DataFrame(data1)

In [3]:
df = pd.concat([df , pd.DataFrame({'Column1':1 , 'Column2':2 , 'Column3':3 , 'Column4':4 , 'Column5':5} ,  index=[0])] , ignore_index = False)

In [6]:
def insert_row_into_dataframe(df , **kwargs):
    valid_columns = ["Column1", "Column2", "Column3", "Column4", "Column5"]
    
    if any(key not in valid_columns for key in kwargs.keys()):
        print("Invalid")
    else:
        #new_row = {column: kwargs.get(column, None) for column in valid_columns}
        new_df = pd.concat([df , pd.DataFrame(kwargs , index = [0])] , ignore_index = False)
        return new_df

In [11]:
new = insert_row_into_dataframe(df , **{'Column1':3 , 'Column2':2 , 'Column3':10 , 'Column4':4 , 'Column5':12923})

In [15]:
df1

Empty DataFrame
Columns: [One, Two, Three, Four, Five]
Index: []

In [16]:
df1.loc[len(df1)] = ["First" , 0 , 0 , 0 , "Row"]

In [17]:
df1

     One  Two  Three  Four Five
0  First    0      0     0  Row

In [28]:
def add_rows(values):
    global df1
    df1.loc[len(df1)] = values
    return df1

In [32]:
add_rows(["Third" , 0 , 0 , 0 ,   "Row"])

      One  Two  Three  Four Five
0   First    0      0     0  Row
1  Second    0      0     0  Row
2   Third    0      0     0  Row

In [35]:
df1

      One  Two  Three  Four Five
0   First    0      0     0  Row
1  Second    0      0     0  Row
2   Third    0      0     0  Row

In [1]:
## Food
## Travel 
## House
## Internet Payments 
## Necessities 
## Extras

In [29]:
import sqlite3
import pandas as pd
from datetime import datetime

datetime.now().strftime('%Y-%m-%d')

'2023-11-30'

In [10]:
conn = sqlite3.connect('expenses.db')

cursor = conn.cursor()

cursor.execute('''
    CREATE TABLE IF NOT EXISTS expenses (
        Date TEXT PRIMARY KEY,
        Food REAL,
        Travel REAL,
        House REAL,
        Internet_Payments REAL,
        Necessities REAL,
        Extras REAL
    )
''')

In [61]:
def add_expense_row(expenses):
    current_date = datetime.now().strftime('%Y-%m-%d')
    expenses_with_date = [current_date] + expenses
    
    cursor.execute('''
        INSERT INTO expenses (Date, Food, Travel, House, Internet_Payments, Necessities, Extras , Investments)
        VALUES (?, ?, ?, ?, ?, ?, ?,?)
    ''', expenses_with_date)
    conn.commit()
    

    
def add_column(column_name , database = 'expenses.db' , table_name = 'expenses', column_type = 'REAL'):
    conn = sqlite3.connect(database)
    cursor = conn.cursor()

    try:
        cursor.execute(f'ALTER TABLE {table_name} ADD COLUMN {column_name} {column_type}')
        conn.commit()
        print(f"Column '{column_name}' added to table '{table_name}'.")
    except sqlite3.Error as e:
        print(f"SQLite error: {e}")
    finally:
        conn.close()

In [63]:
def display_expenses():    
    cursor.execute('SELECT * FROM expenses')
    rows = cursor.fetchall()
    for row in rows:
        print(row)


def display_table_as_dataframe(table_name):
    conn = sqlite3.connect('expenses.db')
    try:
        df = pd.read_sql_query(f'SELECT * FROM {table_name}', conn)
        #print(df.head())
        return df

    except sqlite3.Error as e:
        print(f"SQLite error: {e}")

    finally:
        
        conn.close()
        

        
        
def display_table(table_name):
    conn = sqlite3.connect('expenses.db')
    cursor = conn.cursor()
    try:
        cursor.execute(f'SELECT * FROM {table_name} ORDER BY Date')
        rows = cursor.fetchall()
        column_names = [description[0] for description in cursor.description]
        print(" | ".join(column_names))
        for row in rows:
            print(" | ".join(map(str, row)))

    except sqlite3.Error as e:
        print(f"SQLite error: {e}")

    finally:
        conn.close()